app/controllers/login_controller.rb

  def create
	if params[:user][:email].blank?
---
SELECT * FROM `users` WHERE (`users`.`email` = 'nitin@virtueinfo.com') LIMIT 1