app/controllers/special_controller.rb

  def handle
    data = params[:data].split("/")
    resource = data[0]
    options = data.size > 1 ? data[1..-1] : []

    case resource
    when "Special:RandomPage"
      page = Page.find(:first, :conditions => { :namespace_id => Page.default_namespace }, :order => "RAND()")
      redirect_to :controller => "pages", :action => "show", :id => page.url_slug
      return
    when "Special:RecentChanges"
      @changelog = Revision.find(:all, :order => "id DESC", :limit => 50)
---
SELECT * FROM `namespaces` WHERE (`namespaces`.`name` = 'main') LIMIT 1
SELECT * FROM `pages` WHERE (`pages`.`namespace_id` = 1 AND `pages`.`name` = 'Nitin1_Test_Page') LIMIT 1
SELECT * FROM `revisions` WHERE (`revisions`.`id` = 3)